'''
要求：
使用for循环
输出九九乘法表：
1*1=1
1*2=2   2*2=4
1*3=3   2*3=6   3*3=9
1*4=4   2*4=8   3*4=12  4*4=16
1*5=5   2*5=10  3*5=15  4*5=20  5*5=25
1*6=6   2*6=12  3*6=18  4*6=24  5*6=30  6*6=36
1*7=7   2*7=14  3*7=21  4*7=28  5*7=35  6*7=42  7*7=49
1*8=8   2*8=16  3*8=24  4*8=32  5*8=40  6*8=48  7*8=56  8*8=64        
1*9=9   2*9=18  3*9=27  4*9=36  5*9=45  6*9=54  7*9=63  8*9=72  9*9=81
'''

# 外层控制行
for i in range(1, 10):

    # 内层处理行内的输出
    for j in range(1, i + 1): 
        # 这里由于i和j每一行的最大值都相同，可以使用j作用域和i作用域相同的方法来控制j的循环次数。
        # 以代替j<=i的if语句的写法。更节省代码量。

        # 注意\t对齐，和end=''不换行输出
        print(f"{j}*{i}={j*i}\t", end='')
            
    # 每行输出后，再一次性换行        
    print()