"""
通过for循环，对所有级别为1级的员工，级别上升1级，薪水增加1000元
|姓名|部门|工资|级别|
|wang|科技部|3000|1|
|zhou|市场部|5000|2|
|lin|市场部|7000|3|
|zhang|科技部|4000|1|
|liu|市场部|6000|2|
"""

# 定义字典
info = {
    "wang": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    }, "zhou": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    }, "lin": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    }, "zhang": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1
    }, "liu": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    }
}

print(f"1、全体员工当前信息如下：{info}")

print(f"2、全体员工当前信息如下：（排列整齐版）")
for name in info:
    print(f"\'{name}\': {info[name]}")

print(f"3、全体员工级别为1的员工完成升职加薪后：")
for name in info:
    if  info[name]["级别"] == 1:
        info[name]["工资"] += 1000
        info[name]["级别"] += 1
    print(f"\'{name}\': {info[name]}")
